Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: ཆོས་རྣམས་སྔོན་གྱི་མཐའ་ནས་བྱུང་བ་མེད། །ཕྱི་མའི་མཐར་ཡང་འཕོ་བ་གང་ཡང་མེད། །དེ་བཞིན་ཆོས་ཀུན་བར་ལའང་གནས་མིན་པར། །
en: “Phenomena have not originated in the past, They will never pass away in the future, And they do not abide between the two.

source: ལུས་ནི་སྙིང་པོ་མེད་དེ་གཟུགས་བརྙན་འདྲ། །
en: “The body, like a reflection, has no essence.

source: ངག་ཀྱང་སྟོང་པ་བྲག་ཅ་ལྟ་བུ་སྟེ། །
en: The speech, like an echo, is empty.

source: སེམས་ཀྱང་སྒྱུ་མ་ལྟ་བུར་རླུང་འདྲ་བར། །
en: The mind, like an illusion, is like the wind.

source: ངེས་པའི་མདོ་ཚུལ་ལ་ནི་རབ་ཤེས་ཤིང་། །བརྟེན་ནས་འབྱུང་ཚུལ་ཁོང་དུ་ཆུད་རྟོགས་ལ། །མ་རིག་པ་དང་སྐྱེ་འཆི་འགོག་པ་དག །ངེས་དོན་གང་ཤེས་དེ་ནི་བག་ཡོད་པའོ། །
en: “Those who know the definitive meaning— The way of the definitive discourses and dependent origination, From the cessation of ignorance to the cessation of birth and death— They are the heedful.

source: རྣམ་པར་ཐར་པའི་སྒོ་དང་དུས་གསུམ་དང་། །བསླབ་པ་གསུམ་དང་དམིགས་པ་མེད་པ་དང་། །བདག་མེད་སེམས་ཅན་སྲོག་མེད་གང་ཟག་མེད། །ཆོས་དང་ཆོས་མིན་གཟིངས་དང་འདྲ་བར་བསྟན། །
en: “It has been taught, that the gateways to liberation, the three times, The three trainings, the absence of reference points, The absence of a self, a being, a life force, and an individual, And right and wrong, are all like a raft.

source: མ་སྐྱེས་ཐོབ་དང་མི་འགྱུར་འབྱུང་བ་དང་། །འཇིག་རྟེན་འདས་པའི་དབང་པོ་ཤེས་རབ་སྒོམ། །དེ་ལ་སེམས་པ་ཅུང་ཟད་མི་འབྱུང་སྟེ། །དེ་ཡི་ཚུལ་རྟོགས་པ་ནི་བག་ཡོད་པའོ། །
en: “Without conceptualizing in any way the unborn, Or attainment, the immutable, origination, The transcendent strengths, or the cultivation of insight, Those who understand in this way are the heedful.

source: སངས་རྒྱས་བྱུང་ངམ་མྱ་ངན་འདས་ཀྱང་རུང་། །ཆོས་དབྱིངས་དེ་ནི་རྟག་ཏུ་གནས་པ་སྟེ། །
en: “Whether a buddha has appeared or has passed into nirvāṇa, The realm of phenomena always remains.

source: ཡང་དག་དོན་ནི་རྟག་ཏུ་མཐོང་བ་མཁས། །
en: The wise constantly perceive the true meaning.

source: ཆོས་ཉིད་འདི་ཤེས་པ་ནི་བག་ཡོད་པའོ། །
en: Those who know the true nature are the heedful.

source: སྔོན་གྱི་མཐའ་གང་དེ་ནི་ཡང་དག་མཐའ། །དེ་ཡི་མཐའ་ནི་རྒྱ་ཆེན་ཆོས་རྣམས་ཀུན། །ནམ་མཁའི་མཐའ་ནི་རྟག་ཏུ་སེམས་ཅན་མཐའ། །
en: “The entire extent of the past is the limit of reality, The extent of which is the entire range of phenomena, And the extent of space is ever the extent of beings.

source: ཆོས་ཉིད་ལས་ཀྱི་རྣམ་སྨིན་མེད་ཤེས་ཀྱང་། །དགེ་དང་མི་དགེའི་ལས་ནི་ཆུད་མི་ཟ། །ཕ་རོལ་ཕྱིན་ལ་གནས་པ་མ་གཏོགས་པར། །ཡེ་ཤེས་ཀྱིས་ནི་སངས་རྒྱས་ཐེག་མི་མཐོང་། །
en: “Though they know there is no ripening of karma in the true nature, They do not discard virtue and nonvirtue— For unless one abides in the perfections, One will not see with wisdom the vehicles of the Buddha.

source: དབེན་པར་གནས་པར་ང་རྒྱལ་ཐེག་པ་སྟེ། །ཉན་ཐོས་རྣམ་པར་གྲོལ་བའི་སྒྲ་ཕྱིར་འབྲང་། །སྦྱིན་པ་ཡིས་ནི་ལོངས་སྤྱོད་རབ་ཏུ་འཐོབ། །ཚུལ་ཁྲིམས་ཀྱིས་ནི་མཐོ་རིས་ངེས་པར་འཐོབ། །
en: “Staying in isolation is the vehicle of pride, Hearers follow the words of liberation, Through generosity one attains wealth, Through discipline one attains higher rebirths.

source: ཐོས་པས་ཤེས་རབ་དེ་བཞིན་སྒོམ་པ་འཐོབ། །
en: “By learning that, one attains insight that is familiar with thusness.

source: འདུས་བྱས་ཀུན་ནི་ཚུལ་བཞིན་མིན་ལས་བྱུང་། །གང་དག་མྱ་ངན་འདས་ཀུན་ཚུལ་བཞིན་གྱིས། །
en: All compounded phenomena arise from improper mental engagement, And passing beyond suffering from the proper manner.

source: འདི་འདྲའི་ཆོས་ཉིད་འདི་ནི་བག་ཡོད་པའོ། །
en: To recognize this reality is heedfulness.

source: བྱིས་པ་དག་ནི་རྟག་ཏུ་ཉོན་མོངས་ཕྱེ། །མཁས་པ་ཡེ་ཤེས་ཀྱིས་ནི་ཆོས་སྟོན་ཏོ། །
en: “Immature beings are always beset by afflictions, While the wise teach the Dharma with wisdom.

source: ཆོས་དབྱིངས་རྟག་ཏུ་སྒྲིབ་པ་མེད་པ་ལ། །ཆོས་འདི་ཐམས་ཅད་མཚུངས་པར་རབ་ཏུ་འཇུག །
en: The realm of phenomena is never obscured— It pervades all phenomena equally.

source: བརྟེན་ནས་འབྱུང་བ་རབ་ཏུ་ཤེས་པ་ཡི། །དེ་ཡི་ཡོན་ཏན་བཞི་པོ་འདི་ཡིན་ཏེ། །དོན་དང་ཡེ་ཤེས་དེ་བཞིན་ཆོས་ཉིད་དང་། །ངེས་པའི་དོན་ཤེས་དེ་ནི་བག་ཡོད་པའོ། །
en: “The four qualities Of those who understand dependent origination Are knowing the meaning, the wisdom, the true nature as thusness, And the definitive meaning—this is heedfulness.

source: ཆོས་ཀུན་བརྟེན་པ་ཡིན་པར་གང་ཤེས་པ། །དེས་ནི་ཆོས་མཐོང་བདེ་བར་གཤེགས་ཀྱང་མཐོང་། །
en: “Those who understand that all phenomena are dependent See the Dharma and the Well-Gone One.

source: དེ་ནི་ཆོས་ཉིད་བརྟེན་ནས་འབྱུང་བར་མཉམ། །ཆོས་ཉིད་རྟག་ཏུ་འདོད་ཆགས་བྲལ་བ་ཐོབ། །
en: The sameness of the true nature and dependent origination Is the attainment of the true nature, perpetually free of desire.

source: བརྟེན་ནས་བྱུང་བས་གནས་ཏེ་ཐོབ་འགྱུར་ཏེ། །
en: “Attainment comes by dwelling on dependent origination.

source: ཆོས་ནི་སྒྲ་དང་བྲལ་ཞིང་ཡི་གེ་མེད། །ཆོས་འདི་རྗེས་སུ་རྟོགས་པ་དེ་ཡི་ཕྱིར། །
en: Phenomena are beyond words and sounds.

source: སངས་རྒྱས་ལ་ནི་དེ་བཞིན་གཤེགས་ཞེས་བྱ། །
en: Those who understand this Are therefore called buddha or thus-gone one.

source: ཤེས་རབ་མིག་གིས་བརྟེན་པ་མཐོང་བ་སྟེ། །མཐོང་བ་མེད་པར་མཐོང་བ་ཆོས་མཐོང་བའོ། །
en: “With the eye of insight, they see dependence; To see that there is nothing to be seen is to see the Dharma.

source: ཤེས་རབ་མིག་གིས་བརྟེན་པ་གང་མཐོང་བ། །དེ་ནི་སངས་རྒྱས་མཐོང་བ་ཡིན་ཞེས་བྱ། །
en: One who sees dependence with the eye of insight Is said to be one who sees the Buddha.

source: དེ་ནི་ཕྱིར་ཞིང་ཉོན་མོངས་མི་སྤྱོད་དེ། །
en: “As a result, they never indulge the afflictions.

source: རྟག་ཏུ་འཕགས་པ་ལ་ནི་དད་པར་བྱེད། །ཞིག་པའི་ཆོས་ཀྱང་འདོར་བ་མ་ཡིན་ཞིང་། །འཕགས་པའི་རིགས་ནི་ཀུན་དུ་སྲུང་བར་བྱེད། །
en: They have constant faith in the noble ones, They do not discard phenomena that disintegrate, And they protect the lineage of the noble ones.

source: མཁས་པ་ཐོས་པ་བརྗེད་པར་མི་བྱེད་པ། །
en: “Those wise ones do not forget what they have learned.

source: དེ་ནི་སངས་རྒྱས་བསྟན་པ་ཡོངས་སུ་སྲུང་། །འཕགས་པའི་ཚུལ་ཁྲིམས་སྤོང་བར་མི་བྱེད་དེ། །
en: They resolutely protect the teachings of the Buddha, They do not abandon the discipline of the noble ones, And they never regress from their states of absorption.

source: མཁས་པ་ཏིང་ངེ་འཛིན་ལས་རྟག་མི་ཉམས། །ཤེས་རབ་ཕུང་པོ་ལས་ནི་མཁས་མི་གཡོ། །
en: “Those wise ones do not waver from the aggregate of insight.

source: རྣམ་པར་གྲོལ་བའི་ཕུང་། པོར་རྟག་ཏུ་གནས། །རྣམ་གྲོལ་ཡེ་ཤེས་རྣམ་པར་མཐོང་བ་ལ། །རབ་ཏུ་གནས་པར་གང་གྱུར་བག་ཡོད་པའོ། །
en: They are firmly established in the aggregate of liberation And settled in the liberating wisdom vision— They are the heedful.

source: སངས་རྒྱས་ཆོས་རྣམས་མཐའ་ཡས་རབ་རྟོགས་པ། །དེ་ནི་ཐུབ་པའི་ཡེ་ཤེས་མཐའ་ཡས་ཚོལ། །སངས་རྒྱས་བྱང་ཆུབ་སྤོབས་པ་ཕུན་སུམ་དང་། །སོ་སོར་རིག་དང་སེམས་ཅན་བསམ་པ་ཤེས། །
en: “They understand the boundless qualities of the Buddha, They seek the Sage’s limitless wisdom, They master the awakened eloquence of the Buddha, They have correct understandings, and they know the thoughts of beings.

source: སེམས་ཅན་དག་གི་བསམ་པ་ཚད་མེད་ཤེས། །སྐད་ཅིག་གཅིག་གིས་མཐའ་ཡས་ཞིང་དུ་འགྲོ། །ཚད་མེད་པ་ཡི་དེ་བཞིན་གཤེགས་མཐོང་ནས། །དེ་དག་ལས་ཐོས་ཆོས་ནི་འཛིན་པར་བྱེད། །
en: “They know the countless thoughts of beings, They travel to countless buddha fields in an instant, They see countless thus-gone ones, And they remember the teachings they have heard from them.

source: ཐོས་ནས་དེ་ནི་དེ་བཞིན་དོན་ཀྱང་རྟོགས། །སེམས་ཅན་ཚད་མེད་ཡོངས་སུ་སྨིན་པར་བྱེད། །དེ་དག་གི་ནི་སྤྱོད་པ་ཚད་མེད་ཤེས། །
en: “They understand the meaning of the teachings they have heard, They bring countless beings to maturity, And they know their countless activities.

source: དྲན་དང་ལྡན་པ་གང་ཡིན་བག་ཡོད་པའོ། །
en: Those mindful beings are the heedful.

source: རྟག་ཏུ་བདག་གི་ཁར་ལས་བག་ཡོད་པ། །རང་སེམས་ངེས་པར་སེམས་པ་ཡོན་ཏན་འཇུག །
en: “Those who are independent and heedful Ascertain their own minds and develop qualities.

source: སེམས་ལ་ངེས་སེམས་ཉོན་མོངས་ཡོད་མ་ཡིན། །དེ་ནི་ནམ་དུའང་ཡུལ་གྱིས་ཉམས་པ་མེད། །
en: The mind ascertained is without affliction And never corrupted by objects.

source: སྐྱེ་དང་གནས་དང་འཇིག་པ་ཤེས་པ་ནི། །ཉེ་བར་ལེན་པ་ཀུན་ལས་སེམས་དབེན་ཏེ། །
en: “Understanding birth, abiding, and disintegration, The mind is removed from all grasping.

source: ལྷག་མཐོང་དང་ནི་ཞི་གནས་ལ་ཡང་མཁས། །དེ་ཡི་སྒྲུབ་པ་ཉམས་པར་མི་འགྱུར་རོ། །
en: Skilled in special insight and the practice of tranquility, Their accomplishments will not diminish.

source: ཤིན་ཏུ་ཞི་ཞིང་དུལ་སེམས་ལས་སུ་རུང་། །རྟག་ཏུ་དྲང་ཞིང་གཡོ་མེད་ཡོན་པོ་མིན། །ཚུལ་འཆོས་མེད་ཅིང་མཉེན་ལ་དེས་པ་སྟེ། །འདི་ནི་ངེས་པར་སེམས་པའི་ཕན་ཡོན་ནོ། །
en: “Being utterly peaceful, controlled, flexible, Always honest, sincere, and straightforward, And without hypocrisy, pliant and gentle— These are the benefits of ascertaining the mind.

source: སྟོང་པ་མཚན་མེད་སྨོན་པ་མེད་ཅིང་དབེན། །འཁོར་བ་སྡུག་བསྔལ་བ་དང་མི་རྟག་ཤེས། །རྟག་ཏུ་ཆོས་བདག་མེད་ཅིང་མྱ་ངན་འདས། །
en: “Those who know emptiness, signlessness, wishlessness, isolation, The suffering of saṃsāra, and impermanence, Those who ascertain the perpetual selflessness of phenomena And ascertain nirvāṇa—those ones are heedful.

source: ངེས་པར་སེམས་པའི་སེམས་སྤྱོད་བག་ཡོད་པའོ། །རྟག་ཏུ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་འཛིན་ཅིང་། །སེམས་ཅན་རྣམས་ལ་བྱམས་པའི་སེམས་མཉམ་པ། །
en: “They constantly maintain the mind of omniscience, And they love all beings equally.

source: སྙིང་རྗེས་སེམས་ཅན་རྣམས་ནི་མི་གཏོང་ཞིང་། །དགའ་བས་འཁོར་བ་ན་ནི་སྐྱོ་བ་མེད། །
en: With compassion they do not overlook anyone, And with joy they do not grow weary in saṃsāra.

source: བཏང་སྙོམས་ཆེན་པོ་སྐྱོན་རྣམས་སྤངས་པ་སྟེ། །ཀུན་གཏོང་འདོད་ཆགས་བྲལ་བ་འདོད་པ་མེད། །
en: “With great equanimity that has abandoned all faults, They are ready to sacrifice everything, free of attachment and desire.

source: སྦྱངས་པ་ཐམས་ཅད་དང་ནི་མི་གཡེང་བསྙེན། །བྱས་དང་མ་བྱས་བཟོད་པས་ཇི་མི་སྙམ། །
en: They perform all ascetic practices without distraction, And with patience they take no offense at any action or inaction.

source: སེམས་ཅན་ཐར་བར་བྱ་ཕྱིར་ངོམས་མེད་སེམས། །དེ་ནི་རྩོམ་པ་བརྟན་པར་ཞི་བ་ཚོལ། །ལུས་དང་སྲོག་ལའང་དེ་ནི་མི་ལྟ་ཞིང་། །ཏིང་འཛིན་ཀུན་ལ་རིམ་གྱིས་བསམ་གཏན་བྱེད། །
en: “They do not tire of liberating beings, They pursue peace with constant effort, They have no concern for life or limb, And they concentrate sequentially in the absorptions.

source: ཏིང་འཛིན་དབང་གིས་དེ་ནི་སྐྱེས་མ་ཡིན། །
en: “With the power of absorption, they know the unborn.

source: ཤེས་རབ་ཀྱིས་ནི་འདུས་མ་བྱས་ཤེས་ཀྱང་། །
en: With insight, they know the uncompounded.

source: ཐབས་ཀྱིས་འདུས་མ་བྱས་པར་དེ་མི་ལྟུང་། །
en: With skillful means, they do not fall into the uncompounded.

source: མཁས་པ་སེམས་ཅན་ཀུན་དང་འཐུན་པར་འཇུག །
en: Learned beings are in harmony with all.

source: ཉན་ཐོས་རྣམས་ལ་བདེན་པའི་གཏམ་བརྗོད་ཀྱང་། །རྣམ་པར་གྲོལ་ལ་མཁས་པ་དེ་མི་རེག །
en: “Though the discourses on truth were spoken to hearers, They do not reach the mastery of complete liberation.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ནི་སྙིང་བརྩེ་ཞིང་། །དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རེ། །
en: For being compassionate and loving toward all beings Is part of true omniscience.

source: གང་ལ་འདི་འདྲའི་ཕན་ཡོན་འདི་ཡོད་པ། །སངས་རྒྱས་བསྟན་འདིར་དེ་ནི་བག་ཡོད་ཡིན། །
en: “In this teaching of the Buddha, Those who possess beneficial qualities are the heedful.

source: དེ་ནི་དེ་བཞིན་ཆོས་ཉིད་ལ་ཡང་གནས། །དེ་ཡི་སྤྱོད་པ་བདུད་ཀྱིས་ཤེས་མ་ཡིན། །
en: They abide in the true nature, And their domain is beyond the reach of Māra.

source: བག་ཡོད་པ་ལ་ཚད་ནི་ཡོད་མིན་ཏེ། །ཉོན་མོངས་མཚན་མ་དག་ལ་ཚད་ཡོད་དོ། །
en: “The heedful are without limitation, While the signs of affliction are limited.

source: དེ་ནི་མཚན་མ་མེད་ཅིང་ཉོན་མོངས་བྲལ། །
en: To be beyond signs is to be free of affliction.

source: དེ་ཡི་ཡུལ་ནི་བདུད་ཀྱིས་ཤེས་མི་ནུས། །
en: Their domain is beyond the reach of Māra.

source: གང་རྣམས་གཡོ་ཞིང་རློམ་སེམས་རྟོགས་པ་དག །དེ་ནི་བདུད་ཀྱི་ལས་སུ་ངས་བཤད་དོ། །
en: “I have described those with fickle minds and arrogant thoughts As doing the work of Māra.

source: དམིགས་པ་ཀུན་ལས་རྣམ་པར་རབ་གྲོལ་བ། །ཐམས་ཅད་བདུད་ཀྱིས་ཐུལ་བ་མ་ཡིན་ནོ། །
en: Those who are free of all reference points Are impervious to Māra.

source: བག་ཡོད་པ་ལ་དྲན་པ་བརྗེད་པ་མེད། །
en: “The heedful have unfailing mindfulness.

source: བག་ཡོད་པ་ལ་བློ་གྲོས་བརྗེད་པ་མེད། །
en: The heedful have unfailing intellect.

source: བག་ཡོད་པ་ནི་རྟོགས་དང་མོས་པ་དང་། །
en: The heedful are realized and have conviction.

source: ངོ་ཚ་ཤེས་དང་ཁྲེལ་ཡོད་མི་སྤྱོད་མེད། །
en: They are modest and humble.

source: དེ་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་བསོད་ནམས་དང་། །ཤེས་རབ་དང་ནི་བག་ཡོད་འདི་ཐོས་ནས། །གང་དག་ཆོས་དང་ཆོས་ཉིད་རབ་གནས་པ། །སངས་རྒྱས་ཐམས་ཅད་ཅི་འདྲར་དེ་འགྱུར་རོ། །
en: “Therefore, those who have heard about the merit, The insight, and the heedfulness of the thus-gone ones And who abide in Dharma and the true nature Will become like all the buddhas.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་གང་རྣམས་ཇི་སྙེད་དང་། །བྱང་ཆུབ་སེམས་དཔའ་མཆོད་པར་གང་འདོད་པ། །དེ་དག་གིས་ནི་བག་ཡོད་འདི་ཐོས་ན། །བསམ་པས་ནན་ཏན་སྙིང་པོར་བྱེད་པར་འགྱུར། །
en: “Those who wish to make offerings To all the bodhisattvas and buddhas in the ten directions Will, when they hear this teaching on heedfulness, Make constant effort their main concern.

source: གང་དག་གིས་ནི་བག་ཡོད་འདི་ཐོས་ནས། །དགའ་ཞིང་དད་པ་རྒྱ་ཆེ་རྙེད་གྱུར་པ། །
en: “Those who have learned this heedfulness Develop great joy and faith.

source: རྟག་ཏུ་བག་ཡོད་པར་ནི་རབ་འགྱུར་ཞིང་། །དེ་དག་རང་བྱུང་སངས་རྒྱས་ཉིད་དུ་འགྱུར། །བཅོམ་ལྡན་འདས་ཀྱིས་བག་ཡོད་པའི་ལེའུ་འདི་བཤད་པའི་ཚེ་སྲོག་ཆགས་བཞི་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །སྲོག་ཆགས་ཁྲི་ཉིས་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: They will forever be heedful ones And will become self-arisen buddhas.”

source: སྲོག་ཆགས་བརྒྱད་སྟོང་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །སྲོག་ཆགས་སུམ་ཁྲི་ཉིས་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །དགེ་སློང་བརྒྱད་བརྒྱ་ནི་མ་ལུས་པར་ཀུན་ཤེས་པ་བརྡ་སྤྲོད་པར་གྱུར་ཏོ། །
en: When the Blessed One gave this teaching, the teaching on heedfulness, forty-two thousand beings developed the intention to attain unsurpassed, perfect awakening; twelve thousand beings reached acceptance of the unborn nature of phenomena; eight thousand beings reached concordant acceptance; thirty-two thousand beings purified the Dharma eye that sees phenomena as spotless and immaculate; and eight hundred monks gained understanding of all things, each of them distinct, without exception.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་ནས་སྣང་བ་ཆེན་པོས་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཁྱབ་པར་གྱུར་ཏོ། །
en: This world system, the great trichiliocosm, shook in six ways, and a great light illuminated the entire world.

source: གངས་རིའི་རྒྱལ་པོ་དང་མཚོ་ཆེན་པོ་མ་དྲོས་པ་ཐམས་ཅད་དུ་ཡང་སྔོན་མ་མཐོང་མ་ཐོས་པའི་མེ་ཏོག་གིས་པུས་མོ་ནུབ་པ་ཙམ་དུ་གྱུར་ཏོ། །འདི་ལྟ་སྟེ།
en: The king of mountains and the great lake Anavatapta were covered knee-deep in flowers that had never before been heard of or seen.

source: སངས་རྒྱས་ཀྱི་མཐུ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་དད་པའི་རྒྱུས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་མཚོ་མ་དྲོས་པ་ཐམས་ཅད་རིན་པོ་ཆེའི་པད་མ་དྲི་རབ་ཏུ་ཞིམ་པ་ཁ་དོག་བརྒྱ་སྟོང་དུ་མ་ཚད་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་མུ་མེད་པས་གང་བར་གྱུར་ཏོ། །
en: Then, through the Buddha’s power and the faith of the nāga king Anavatapta, as an act of worship to this Dharma teaching, all of Lake Anavatapta was filled with hundreds of thousands of sweet-smelling, precious lotus flowers the size of cartwheels that displayed hundreds of thousands of different colors.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོའི་བུ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ལྔ་བརྒྱ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་སོ་སོ་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རིན་པོ་ཆེའི་གདུགས་རྣམས་ཕུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་ནི་བདག་ཅག་གི་ཆེད་དུ་བྱུང་བ་ལགས་སོ། །
en: Then, five hundred nāga princes who were followers of the Great Vehicle offered precious parasols as an act of worship to the Blessed One and said, “Blessed One, the Buddha has appeared for our sake.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་བདག་ཅག་འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འཐུན་པའི་ཆོས་འདི་ཐོས་ཀྱང་མ་དངངས་མ་སྐྲག་དངངས་པར་མ་གྱུར་གྱི། འདི་ལྟ་བུའི་ཆོས་ཉན་པ་ལ་སླར་ཞིང་ངོམས་མ་འཚལ་བའི་སླད་དུའོ། །
en: So that when we hear this Dharma that contradicts all worldly conventions, Blessed One, we are not scared, afraid, or terrified, and so that those who have listened to the Dharma will not need to search for further fulfillment in the future.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་འབྱུང་བ་ཅི་འདྲ།
en: Blessed One, please tell us. How is it that a buddha arises for bodhisattvas?

source: ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་ཅི་འདྲ།
en: How does one turn the wheel of Dharma?

source: དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ཅི་འདྲ་བ་བཤད་དུ་གསོལ།
en: How does one maintain the sacred Dharma?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བཞིན་བཟངས་དག་དེའི་ཕྱིར་ལེགས་པར་ཤིན་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དངངས་བཤད་དོ། །
en: The Blessed One said, “Friends, listen carefully and retain it.

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ་ཀླུའི་རྒྱལ་པོའི་བུ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: I shall explain.” “Very good, Blessed One,” they replied, and the nāga princes listened as the Blessed One had instructed.

source: བཞིན་བཟངས་དག་དད་པ་འབྱུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་འབྱུང་བའོ། །
en: The Blessed One continued, “Friends, for a bodhisattva, the arising of faith is the arising of a buddha.

source: དད་པ་དད་པ་ཞེས་བྱ་བ་དེ་གང་ཞེ་ན།
en: What is meant by faith?

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའོ། །དེ་ལ་འཇིག་རྟེན་པའི་དད་པ་གང་ཞེ་ན།
en: There is worldly faith, and there is faith that goes beyond the world. What is worldly faith?

source: དད་པ་གང་གིས་དགེ་བའི་ཆོས་རྣམས་ཀྱི་སྔོན་དུ་འགྲོ་བ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་དང་། ལས་དང་མི་འགལ་བ་དང་།
en: Those with worldly faith pursue virtuous qualities with confidence in the ripening of karma and that that the law of karma is not contradicted.

source: འཕགས་པ་རྣམས་ལ་སྟེན་པ་དང་། བསྟི་སྟང་དུ་བྱས་ཏེ་དད་པར་གནས་པས་གདུང་བ་མེད་པ་དང་། བསྟི་སྟང་དུ་བྱས་ཏེ་ཆོས་ཉན་པ་དང་།
en: Because they live with faith, attending to and acting respectfully toward the noble ones, they are without anxiety, and they listen to the Dharma with respect.

source: སྒྲིབ་པ་སེལ་བ་དང་།
en: They clear away obscurations.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྒོམ་པ་དང་།
en: They cultivate the branches of awakening.

source: ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་།
en: They actively seek the Dharma.

source: ལོངས་སྤྱོད་སྦྱིན་ཞིང་བགེད་པ་དང་།
en: They give away and distribute wealth.

source: ངང་ཚུལ་ངན་པ་ཚུལ་ཁྲིམས་ལ་འགོད་པ་དང་།
en: They bring discipline to those with bad habits.

source: ཡང་དག་པ་ལ་སྦྱོར་བ་དང་།
en: They connect them to what is right.

source: གཤེ་བ་དང་སྡང་བ་རྣམས་དང་བར་བྱེད་པ་དང་།
en: They instill faith in those who criticize the Dharma and are hostile to it.

source: ཐམས་ཅད་མཁྱེན་པའི་སེམས་ལས་མི་འགོང་བ་དང་།
en: They are not deterred from the mind of omniscience.

source: སངས་རྒྱས་ལ་དད་པ་མི་ཕྱེད་པ་དང་།
en: They have unshakable faith in the Buddha.

source: ཆོས་ལ་དད་ཅིང་མི་སྤོང་བ་དང་།
en: They have unfailing faith in the Dharma.

source: དགེ་འདུན་ལ་ཡང་དག་པར་དད་པ་དང་།
en: They have genuine faith in the Saṅgha.

source: ང་རྒྱལ་ལས་ཀྱང་ང་རྒྱལ་རྣམ་པར་སྤངས་ནས་སེམས་མཚུངས་པ་དང་།
en: They have abandoned pride beyond pride and are impartial.

source: ཡུལ་ལ་ཡེ་ཤེས་ཆགས་པ་མེད་པ་དང་།
en: They have developed wisdom that is not attached to objects.

source: ལུས་དང་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་སྤྱོད་པ་དང་།
en: They do not commit negative deeds, even at the cost of their own life and limb.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་དང་།
en: They follow through on their words.

source: བདུད་ཀྱི་ཡུལ་ལས་ཤིན་ཏུ་འདས་པ་དང་།
en: They have transcended the domain of Māra.

source: འཕགས་པས་གནང་བའི་ལུས་དང་། ངག་དང་།
en: In accordance with the noble ones’ prescriptions, they avoid misdeeds of body, speech, and mind.

source: ཡིད་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཆོག་ཤེས་པས་འཚོ་བ་རྣམ་པར་དག་པ་དང་།
en: Having contentment, their lifestyles are pure.

source: ཤེས་པས་ཡང་དག་པར་འཇུག་པས་ཤེས་རབ་ཀྱི་ཕུང་པོའི་རྩ་བ་ཡོངས་སུ་ཚོལ་བ་དང་།
en: With understanding and genuine engagement, they pursue the roots of the aggregate of insight.

source: ནོར་བདུན་ཡང་དག་པར་འདུ་བ་དང་།
en: They embody the seven treasures.

source: སྟོབས་ཀྱི་སྔོན་དུ་དབང་པོ་འགྲོ་བ་དང་།
en: Before the powers, they develop the strengths.

source: ལོག་པར་ལྟ་བ་ལ་ཁ་ན་མ་ཐོ་བར་འདུ་ཤེས་པ་དང་།
en: They perceive wrong views as misdeeds.

source: ཡང་དག་པར་ལྟ་བ་ལ་ཡང་དག་པར་སྦྱོར་བ་དང་།
en: They are correctly aligned with the right view.

source: རྗེས་སུ་བསྟན་པ་ལ་འཐུན་པར་འཛིན་པ་དང་།
en: They maintain the teachings properly.

source: གསོ་སླ་ཞིང་དགང་སླ་བ་དང་།
en: They are content and easily satisfied.

source: དམིགས་པ་མེད་པའི་སེམས་ཀྱིས་བསྟི་སྟང་དུ་བྱས་ཏེ། ཉེ་བར་འགྲོ་བ་དང་།
en: They approach and serve the Dharma with their minds free of reference points.

source: འཁོར་བ་ལ་སྐྱོ་བའི་སེམས་དང་།
en: They do not become disheartened in saṃsāra.

source: མྱ་ངན་ལས་འདས་པ་ལ་ཡོན་ཏན་དང་ཕན་ཡོན་དུ་ལྟ་བ་དང་།
en: They see the advantages and benefits of nirvāṇa.

source: དམ་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ་དང་།
en: They strive in their pursuit of the sacred Dharma.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ཁྱིམ་ནས་འབྱུང་བའི་སེམས་དང་།
en: They commit to living as renunciants under the Thus-Gone One’s teachings.

source: ཚངས་པར་སྤྱོད་པར་གནས་པ་ལ་ཆོག་མི་ཤེས་པ་དང་།
en: They never tire of observing the holy life.

source: ཕ་རོལ་རྗེས་སུ་བཟུང་བར་བྱེད་པས་ངེས་པར་སྦྱིན་པ་དང་། བྱས་པ་གཟོ་བ་དང་།
en: They are truly generous when it comes to supporting others.

source: བྱས་པ་ཤེས་པ་དང་།
en: They are grateful and appreciative.

source: བྱས་པ་ལ་རེ་བ་མེད་པ་དང་།
en: They have no expectation of reward.

source: བདག་གི་འཐོབ་པས་རློམ་སེམས་སུ་མི་བྱེད་པ་དང་།
en: They do not think about their own accomplishments.

source: ཕ་རོལ་གྱི་འཐོབ་པ་ལ་ཕྲག་དོག་མེད་པ་དང་།
en: They are not jealous about others’ accomplishments.

source: བཟོད་པ་དང་། དེས་པ་དང་།
en: They are patient and gentle.

source: ཁ་ན་མ་ཐོ་བ་ལ་ཉེས་པར་ལྟ་བ་དང་།
en: They see the error in misdeeds.

source: ལྟུང་བ་བྱུང་བ་ལ་མི་གླེང་བ་དང་།
en: They do not talk about the failings of others.

source: དབང་པོའི་སྒོ་སྲུང་བ་དང་།
en: They guard the gates of their senses.

source: མལ་ཆ་སྤོང་ཞིང་གཏོང་བ་དང་།
en: They forego and renounce bedding.

source: དགོན་པ་ལ་ཕྱོགས་པ་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་བས་རྟག་པར་རྒྱུན་དུ་དབེན་པ་ལ་གཞོལ་བ་དང་།
en: They are committed to the solitary life and are always drawn toward seclusion.

source: ཡང་དག་པར་དགའ་བར་འགྱུར་བའི་ཆོས་རྣམས་ལ་འཛིན་པ་མེད་པའི་སེམས་དང་།
en: They are not attached to luxurious things.

source: རྩོད་པ་མེད་པ་དང་།
en: They never take part in conflict.

source: ང་རྒྱལ་ལས་ཀྱང་ང་རྒྱལ་རྣམ་པར་སྤོང་བ་དང་།
en: They reject pride beyond pride.

source: བདག་གི་ཉེས་པ་ལ་ལྟ་བ་དང་། ཕ་རོལ་གྱི་ཉེས་པ་བཟོད་པར་བྱེད་པ་དང་།
en: They focus on their own faults while tolerating the faults of others.

source: ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བ་དང་།
en: They exert themselves in the accumulation of discipline.

source: ཏིང་ངེ་འཛིན་གྱི་ཚོགས་སྒྲུབ་པ་དང་།
en: They practice the accumulation of concentration.

source: ལམ་གྱི་ཚོགས་ལ་བརྩོན་པ་འདི་ནི་བཞིན་བཟངས་དག་འཇིག་རྟེན་པའི་དད་པ་ཞེས་བྱ་སྟེ།
en: And they diligently gather the accumulation of the path. Friends, this is what is meant by worldly faith.

source: བཞིན་བཟངས་དག་གང་འཇིག་རྟེན་པའི་དད་པ་འབྱུང་བ་ནི་སངས་རྒྱས་འབྱུང་བ་ཞེས་བྱའོ། །
en: Friends, the arising of worldly faith is known as the arising of a buddha.

source: དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་དད་པ་གང་ཞེ་ན།
en: “What is faith that goes beyond the world?

source: དད་པ་གང་གིས་ཆོས་ཐམས་ཅད་སྟོང་པར་ཡིད་ཆེས་པ་དང་། ལྟ་བར་སོང་བ་ཐམས་ཅད་དང་།
en: Faith that goes beyond the world is confidence in the emptiness of all phenomena—those with such faith are free from all wrong views.

source: བྲལ་བ་དང་། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པར་ཡིད་ཆེས་པ་དང་།
en: It is confidence that all phenomena are beyond signs and beyond wishes.

source: ཆོས་ཐམས་ཅད་མངོན་པར་འདུས་མ་བྱས་པ་སྟེ། འོང་བ་དང་འགྲོ་བ་ལས་ལོག་པར་ཡིད་ཆེས་པ་དང་།
en: It is confidence that all phenomena are unfabricated, beyond coming and going.

source: ཆོས་ཐམས་ཅད་ལུས་དང་། ངག་དང་། སེམས་དང་བྲལ་ཞིང་འདོད་ཆགས་དང་བྲལ་བར་ཡིད་ཆེས་པ་དང་། བདག་དང་།
en: It is confidence that all phenomena are free from body, speech, and mind and free from attachment.
